#pragma once

#include <iostream>
#include <unordered_map>
#include <vector>
#include <queue>
#include <string>
#include <utility>
#include <stack>
#include <windows.h>

using namespace std;

#include "Struct.h"
#include "Enum.h"

#define INF 999999999
#define TRANSFER_TIME 180

const vector<StationInfo> stations =
{
	{ "용산", 1 }, { "남영", 1 }, { "서울역", 1 }, { "시청", 1 }, { "종각", 1 }, { "종로3가", 1 }, { "종로5가", 1 }, { "동대문", 1 }, { "동묘앞", 1 }, { "신설동", 1 }, { "제기동", 1 }, { "청량리", 1 },
	{ "당산", 2 }, { "합정", 2 }, { "홍대입구", 2 }, { "신촌", 2 }, { "이대", 2 }, { "아현", 2 }, { "충정로", 2 }, { "시청", 2 }, { "입지로입구", 2 }, { "을지로3가", 2 }, { "을지로4가", 2 }, { "동대문역사문화공원", 2 }, { "신당", 2 }, { "상왕십리", 2 }, { "왕십리", 2 }, { "한양대", 2 },
	{ "경복궁", 3 }, { "안국", 3 }, { "종로3가", 3 }, { "을지로3가", 3 }, { "충무로", 3 }, { "동대입구", 3 }, { "약수", 3 }, { "금호", 3 }, { "옥수", 3 },
	{ "이촌", 4 }, { "신용산", 4 }, { "삼각지", 4 }, { "숙대입구", 4 }, { "서울역", 4 }, { "회현", 4 }, { "명동", 4 }, { "충무로", 4 }, { "동대문역사문화공원", 4 }, { "동대문", 4 }, { "혜화", 4 },
	{ "마포", 5 }, { "공덕", 5 }, { "애오개", 5 }, { "충정로", 5 }, { "서대문", 5 }, { "광화문", 5 }, { "종로3가", 5 }, { "을지로4가", 5 }, { "동대문역사문화공원", 5 }, { "청구", 5 }, { "신금호", 5 }, { "행당", 5 }, { "왕십리", 5 }, { "마장", 5 },
	{ "망원", 6 }, { "합정", 6 }, { "상수", 6 }, { "광흥창", 6 }, { "대흥", 6 }, { "공덕", 6 }, { "효창공원앞", 6 }, { "삼각지", 6 }, { "녹사평", 6 }, { "이태원", 6 }, { "한강진", 6 }, { "버티고개", 6 }, { "약수", 6 }, { "청구", 6 },
};

const vector<int> transitTimes =
{
	110, 120, 120, 100, 90, 90, 90, 80, 80, 90, 100,
	170, 100, 110, 90, 90, 90, 110, 90, 90, 80, 100, 100, 100, 90, 100,
	100, 90, 70, 80, 100, 90, 90, 90,
	100, 90, 100, 100, 90, 90, 80, 100, 90, 90,
	100, 110, 100, 90, 120, 100, 90, 90, 100, 100, 100, 100, 100,
	100, 100, 100, 100, 110, 100, 130, 110, 90, 100, 110, 90, 90,
};